HashDefineElectronics/BC_Touchy_Firmware/Bootloader/Firmware/EFM8BB3_SLSTK2022A/Bootloader/UART/src/flash.c
/******************************************************************************
 * Copyright (c) 2015 by Silicon Laboratories Inc. All rights reserved.
 *
 * http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt
 *****************************************************************************/

#include "efm8_device.h"
#include "flash.h"

// Holds the flash keys received in the prefix command
uint8_t flash_key1;
uint8_t flash_key2;

// ----------------------------------------------------------------------------
// Writes one byte to flash memory.
// ----------------------------------------------------------------------------
void writeByte(uint16_t addr, uint8_t byte)
{
  uint8_t SI_SEG_XDATA * pwrite = (uint8_t SI_SEG_XDATA *) addr;

  // Unlock flash by writing the key sequence
  FLKEY = flash_key1;
  FLKEY = flash_key2;

  // Enable flash writes, then do the write
  PSCTL |= PSCTL_PSWE__WRITE_ENABLED;
  *pwrite = byte;
  PSCTL &= ~(PSCTL_PSEE__ERASE_ENABLED|PSCTL_PSWE__WRITE_ENABLED);
}

// ----------------------------------------------------------------------------
// Erases one page of flash memory.
// ----------------------------------------------------------------------------
void flash_erasePage(uint16_t addr)
{
  // Enable flash erasing, then start a write cycle on the selected page
  PSCTL |= PSCTL_PSEE__ERASE_ENABLED;
  writeByte(addr, 0);
}

// ----------------------------------------------------------------------------
// Writes one byte to flash memory.
// ----------------------------------------------------------------------------
void flash_writeByte(uint16_t addr, uint8_t byte)
{
  // Don't bother writing the erased value to flash
  if (byte != 0xFF)
  {
    writeByte(addr, byte);
  }
}

// ----------------------------------------------------------------------------
// Check if flash address range may be erased or written.
// ----------------------------------------------------------------------------
bool flash_isValidRange(uint16_t addr, uint8_t size)
{
  // Test address range against the upper flash limit for this device
  if ((addr < BL_FLASH0_LIMIT) && (addr + size <= BL_FLASH0_LIMIT))
  {
    return true;
  }
  else
  {
    return false;
  }
}

// ----------------------------------------------------------------------------
// Return the CRC register value.
// ----------------------------------------------------------------------------
uint16_t flash_readCRC(void)
{
  uint16_t crc16;

  // Read the result starting with the MSB
  CRC0CN0 |= CRC0CN0_CRCPNT__ACCESS_UPPER;
  crc16  = CRC0DAT << 8;
  crc16 |= CRC0DAT;

  // Restore the default SFR page
  SET_SFRPAGE(0);
  return crc16;
}
